In [1]:
# # 문제 11 유형(DataSet_11.csv 이용)

# 구분자 : comma(“,”), 470 Rows, 4 Columns, UTF-8 인코딩

# 세계 각국의 행복지수를 비롯한 여러 정보를 조사한 DS리서치는
# 취합된 자료의 현황 파악 및 간단한 통계분석을 실시하고자 한다.

# 컬 럼 / 정 의 / Type
# Country / 국가명 / String
# Happiness_Rank / 당해 행복점수 순위 / Double
# Happiness_Score / 행복점수 / Double
# year / 년도 / Double

In [2]:
import pandas as pd
import numpy as np

In [27]:
data11 = pd.read_csv('../Dataset/Dataset_11.csv')
data11.head()

       Country  Happiness_Rank  Happiness_Score  year
0  Switzerland               1            7.587  2015
1      Iceland               2            7.561  2015
2      Denmark               3            7.527  2015
3       Norway               4            7.522  2015
4       Canada               5            7.427  2015

In [4]:
# 1.분석을 위해 3년 연속 행복지수가 기록된 국가의 데이터를 사용하고자 한다. 
# 3년 연속 데이터가 기록되지 않은 국가의 개수는?
# - 국가명 표기가 한 글자라도 다른 경우 다른 국가로 처리하시오.
# - 3년 연속 데이터가 기록되지 않은 국가 데이터는 제외하고 이를 향후 분석에서
# 활용하시오.(답안 예시) 1

In [35]:
q1 = pd.pivot_table(data11, index='Country', columns='year', values='Happiness_Score')
q1

year          2015   2016   2017
Country
Afghanistan  3.575  3.360  3.794
Albania      4.959  4.655  4.644
Algeria      5.605  6.355  5.872
Angola       4.033  3.866  3.795
Argentina    6.574  6.650  6.599
...            ...    ...    ...
Venezuela    6.810  6.084  5.250
Vietnam      5.360  5.061  5.074
Yemen        4.077  3.724  3.593
Zambia       5.129  4.795  4.514
Zimbabwe     4.610  4.193  3.875

[166 rows x 3 columns]

In [42]:
q1.isna().any(axis=1).sum()

20

In [43]:
# 답 : 20

In [44]:
# 2.(1번 산출물을 활용하여) 2017년 행복지수와 2015년 행복지수를 활용하여 국가별
# 행복지수 증감률을 산출하고 행복지수 증감률이 가장 높은 3개 국가를 행복지수가
# 높은 순서대로 차례대로 기술하시오.
# 증감률 = (2017년행복지수−2015년행복지수)/2
# 
# - 연도는 년월(YEAR_MONTH) 변수로부터 추출하며, 연도별 매출금액합계는 1월부터
# 12월까지의 매출 총액을 의미한다. (답안 예시) Korea, Japan, China

In [45]:
q2 = q1.dropna()

In [46]:
q2.head(3)

year          2015   2016   2017
Country
Afghanistan  3.575  3.360  3.794
Albania      4.959  4.655  4.644
Algeria      5.605  6.355  5.872

In [47]:
q2['ratio'] = (q2[2017] - q2[2015]) / 2
q2['ratio'].nlargest(3).index

C:\Users\BAUM\AppData\Local\Temp\ipykernel_13132\3204922292.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  q2['ratio'] = (q2[2017] - q2[2015]) / 2

Index(['Latvia', 'Romania', 'Togo'], dtype='object', name='Country')

In [48]:
# 답 : Latvia, Romania, Togo

In [49]:
# 3.(1번 산출물을 활용하여) 년도별 행복지수 평균이 유의미하게 차이가 나는지
# 알아보고자 한다. 
# 이와 관련하여 적절한 검정을 사용하고 검정통계량을 기술하시오.
# - 해당 검정의 검정통계량은 자유도가 2인 F 분포를 따른다.
# - 검정통계량은 소수점 넷째 자리까지 기술한다. (답안 예시) 0.1234

In [50]:
from scipy.stats import f_oneway
from statsmodels.formula.api import ols
from statsmodels.stats.anova import anova_lm

In [51]:
q3_out = f_oneway(q2[2015], q2[2016], q2[2017])
q3_out

F_onewayResult(statistic=0.004276725037689305, pvalue=0.9957324489944479)

In [52]:
# 답 : 0.0042

In [54]:
# # 문제 12 유형(DataSet_12.csv 이용)

# 구분자 : comma(“,”), 5000 Rows, 7 Columns, UTF-8 인코딩

# 직장인의 독서 실태를 분석하기 위해서 수도권 거주자 5000명을
# 대상으로 간단한 인적 사항과 연간 독서량 정보를 취합하였다.

# 컬 럼 / 정 의 / Type
# Age / 나이 / String
# Gender / 성별(M: 남성) / String
# Dependent_Count / 부양가족 수 / Double
# Education_Level / 교육 수준 / String
# is_Married / 결혼 여부(1: 결혼) / Double
# Read_Book_per_Year / 연간 독서량(권) / Double
# Income_Range / 소득 수준에 따른 구간(A < B < C < D < E)이며 X는
# 정보 누락 / String

In [55]:
import pandas as pd
import numpy as np

In [56]:
data12 = pd.read_csv('../Dataset/Dataset_12.csv')
data12.head(3)

,Age,Gender,Dependent_Count,Education_Level,is_Married,Read_Book_per_Year,Income_Range
0,52,M,2,석사,1,45,D
1,46,F,4,박사,1,26,X
2,53,F,0,석사,0,48,A

In [57]:
# 1.수치형 변수를 대상으로 피어슨 상관분석을 실시하고 연간 독서량과 가장
# 상관관계가 강한 변수의 상관계수를 기술하시오
# - 상관계수는 반올림하여 소수점 셋째 자리까지 기술하시오. (답안 예시) 0.123

In [58]:
data12.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 7 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Age                 5000 non-null   int64
 1   Gender              5000 non-null   object
 2   Dependent_Count     5000 non-null   int64
 3   Education_Level     5000 non-null   object
 4   is_Married          5000 non-null   int64
 5   Read_Book_per_Year  5000 non-null   int64
 6   Income_Range        5000 non-null   object
dtypes: int64(4), object(3)
memory usage: 273.6+ KB

In [59]:
var_list = ['Age', 'Dependent_Count', 'is_Married', 'Read_Book_per_Year']

In [62]:
q1 = data12[var_list].corr().drop('Read_Book_per_Year')['Read_Book_per_Year']
q1

Age                0.796843
Dependent_Count   -0.132591
is_Married         0.027221
Name: Read_Book_per_Year, dtype: float64

In [63]:
abs(q1).max()

0.7968432255640444

In [64]:
# 답 : 0.797

In [65]:
# 2.석사 이상(석사 및 박사) 여부에 따라서 연간 독서량 평균이 유의미하게 다른지 가설
# 검정을 활용하여 알아보고자 한다. 독립 2표본 t검정을 실시했을 때 
# 유의 확률(pvalue)의 값을 기술하시오.
# - 등분산 가정 하에서 검정을 실시한다.
# - 유의 확률은 반올림하여 소수점 셋째 자리까지 기술한다. (답안 예시) 0.123

In [66]:
q2 = data12.copy()
q2.head(3)

,Age,Gender,Dependent_Count,Education_Level,is_Married,Read_Book_per_Year,Income_Range
0,52,M,2,석사,1,45,D
1,46,F,4,박사,1,26,X
2,53,F,0,석사,0,48,A

In [67]:
q2['Education_Level'].unique()

array(['석사', '박사', '학사', '고졸'], dtype=object)

In [69]:
q2['is_grad'] = q2['Education_Level'].isin(['석사', '박사'])+0
q2['is_grad']

0       1
1       1
2       1
3       0
4       1
       ..
4995    1
4996    0
4997    0
4998    0
4999    1
Name: is_grad, Length: 5000, dtype: int32

In [70]:
from scipy.stats import ttest_ind

In [72]:
q2_out = ttest_ind(q2.loc[q2['is_grad']==1, 'Read_Book_per_Year'],
                  q2.loc[q2['is_grad']==0, 'Read_Book_per_Year'])
q2_out

Ttest_indResult(statistic=1.106510391765204, pvalue=0.2685589229897138)

In [73]:
# 답 : 0.269

In [74]:
# 3.독서량과 다른 수치형 변수의 관계를 다중선형회귀분석을 활용하여 알아보고자 한다. 
# 연간 독서량을 종속변수, 나머지 수치형 자료를 독립변수로 한다. 이렇게 생성한
# 선형회귀 모델을 기준으로 다른 독립변수가 고정이면서 나이만 다를 때, 40살은 30살
# 보다 독서량이 얼마나 많은가?
# - 학사 이상이면서 소득 구간 정보가 있는 데이터만 사용하여 분석을 실시하시오.
# - 결과값은 반올림하여 정수로 표기하시오. (답안 예시) 1

In [76]:
# from statsmodels.formula.api import ols

In [77]:
data12.head(3)

,Age,Gender,Dependent_Count,Education_Level,is_Married,Read_Book_per_Year,Income_Range
0,52,M,2,석사,1,45,D
1,46,F,4,박사,1,26,X
2,53,F,0,석사,0,48,A

In [78]:
q3 = data12[data12['Education_Level'].isin(['학사', '석사', '박사'])]
q3.head()

,Age,Gender,Dependent_Count,Education_Level,is_Married,Read_Book_per_Year,Income_Range
0,52,M,2,석사,1,45,D
1,46,F,4,박사,1,26,X
2,53,F,0,석사,0,48,A
3,55,M,2,학사,1,45,D
4,51,F,3,석사,0,46,A

In [79]:
q3.Income_Range.unique()

array(['D', 'X', 'A', 'B', 'C', 'E'], dtype=object)

In [80]:
q3.Income_Range.value_counts()

A    1264
B     584
D     547
C     452
X     378
E     241
Name: Income_Range, dtype: int64

In [81]:
q3 = q3[~(q3.Income_Range == 'X')]

In [82]:
q3.Income_Range.value_counts()

A    1264
B     584
D     547
C     452
E     241
Name: Income_Range, dtype: int64

In [85]:
q3.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3088 entries, 0 to 4999
Data columns (total 7 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Age                 3088 non-null   int64
 1   Gender              3088 non-null   object
 2   Dependent_Count     3088 non-null   int64
 3   Education_Level     3088 non-null   object
 4   is_Married          3088 non-null   int64
 5   Read_Book_per_Year  3088 non-null   int64
 6   Income_Range        3088 non-null   object
dtypes: int64(4), object(3)
memory usage: 193.0+ KB

In [86]:
q3.dtypes

Age                    int64
Gender                object
Dependent_Count        int64
Education_Level       object
is_Married             int64
Read_Book_per_Year     int64
Income_Range          object
dtype: object

In [88]:
var_list = q3.columns[q3.dtypes == 'int64'].drop('Read_Book_per_Year')
var_list

Index(['Age', 'Dependent_Count', 'is_Married'], dtype='object')

In [89]:
from statsmodels.formula.api import ols

In [90]:
form = 'Read_Book_per_Year~'+'+'.join(var_list)

In [91]:
model = ols(form, data=q3).fit()

In [92]:
model.params

Intercept         -0.382146
Age                0.796440
Dependent_Count   -0.250269
is_Married         0.049624
dtype: float64

In [93]:
model.params['Age']

0.7964402066284841

In [94]:
model.params['Age']*(40-30)

7.964402066284841

In [95]:
# 답 : 8

In [96]:
# # 문제 13 유형(DataSet13_train.csv / DataSet13_test.csv  이용)

# 구분자 : 
#     comma(“,”), 1500 Rows, 10 Columns, UTF-8 인코딩 / 
#     comma(“,”), 500 Rows, 10 Columns, UTF-8 인코딩

# 전국의 데이터 분석가 2000명을 대상으로 이직 관련 설문조사를 실시하였다. 
# 설문 대상자의 특성 및 이직 의사와 관련 인자를 면밀히 살펴보기 위해 다양한
# 분석을 실시하고자 한다.

# 컬 럼 / 정 의 / Type
# city_development_index / 거주 도시 개발 지수 / Double
# gender / 성별 / String
# relevent_experience / 관련 직무 경험 여부(1 : 유경험) / Integer
# enrolled_university / 대학 등록 형태(1 : 풀타임/파트타임) / Integer
# education_level / 교육 수준 / String
# major_discipline / 전공 / String
# experience / 경력 / Double
# last_new_job / 현 직장 직전 직무 공백 기간 / Double
# training_hours / 관련 직무 교육 이수 시간 / Double
# target / 이직 의사 여부(1 : 의사 있음) / Integer

In [97]:
import pandas as pd
import numpy as np

In [98]:
data13 = pd.read_csv('../Dataset/Dataset_13_train.csv')
data13.head()

,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,last_new_job,training_hours,target
0,0.516,Male,1,0,Graduate,STEM,13,5,36,1
1,0.766,Male,1,0,Graduate,STEM,12,5,264,0
2,0.920,Male,1,0,Masters,STEM,10,2,99,0
3,0.899,Male,1,0,Graduate,Business Degree,16,1,20,0
4,0.884,Male,1,0,Masters,STEM,20,5,39,0

In [99]:
# 1.(Dataset_13_train.csv를 활용하여) 경력과 최근 이직시 공백기간의 상관관계를 보고자
# 한다. 남여별 피어슨 상관계수를 각각 산출하고 더 높은 상관계수를 기술하시오.
# - 상관계수는 반올림하여 소수점 둘째 자리까지 기술하시오. (답안 예시) 0.12

In [100]:
data13.columns

Index(['city_development_index', 'gender', 'relevent_experience',
       'enrolled_university', 'education_level', 'major_discipline',
       'experience', 'last_new_job', 'training_hours', 'target'],
      dtype='object')

In [101]:
data13.groupby('gender')[['experience', 'last_new_job']].corr()

                     experience  last_new_job
gender
Female experience      1.000000      0.451898
       last_new_job    0.451898      1.000000
Male   experience      1.000000      0.411155
       last_new_job    0.411155      1.000000

In [102]:
# 답 : 0.45

In [103]:
# 2.(Dataset_13_train.csv를 활용하여) 기존 데이터 분석 관련 직무 경험과 이직 의사가 서로
# 관련이 있는지 알아보고자 한다. 이를 위해 독립성 검정을 실시하고 해당 검정의 p-value를 기술하시오.
# - 검정은 STEM 전공자를 대상으로 한다.
# - 검정은 충분히 발달된 도시(도시 개발 지수가 제 85 백분위수 초과)에 거주하는 사람을
# 대상으로 한다.
# - 이직 의사 여부(target)은 문자열로 변경 후 사용한다.
# - p-value는 반올림하여 소수점 둘째 자리까지 기술하시오. (답안 예시) 0.12

In [104]:
data13.head(3)

,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,last_new_job,training_hours,target
0,0.516,Male,1,0,Graduate,STEM,13,5,36,1
1,0.766,Male,1,0,Graduate,STEM,12,5,264,0
2,0.920,Male,1,0,Masters,STEM,10,2,99,0

In [105]:
q2 = data13.copy()

In [107]:
q2['target'] = q2['target'].astype(str)
q2['target'].dtype

dtype('O')

In [108]:
q2['major_discipline'].value_counts()

STEM               1290
Humanities          110
Arts                 38
Other                33
Business Degree      29
Name: major_discipline, dtype: int64

In [109]:
base = q2['city_development_index'].quantile(0.85)

In [110]:
ord1 = (q2['major_discipline'] == 'STEM')
ord2 = q2['city_development_index'] > base

In [111]:
q2_1 = q2[ord1 & ord2]

In [112]:
q2_1.head()

,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,last_new_job,training_hours,target
6,0.939,Female,1,0,Graduate,STEM,9,5,148,0
14,0.939,Male,1,0,Masters,STEM,20,1,73,0
20,0.925,Male,1,0,Masters,STEM,16,2,8,0
38,0.925,Male,1,0,Graduate,STEM,15,4,108,0
56,0.939,Male,0,0,Graduate,STEM,3,2,109,0

In [113]:
from scipy.stats import chi2_contingency

In [114]:
q2_tab = pd.crosstab(index=q2_1['relevent_experience'], columns=q2_1['target'])
q2_tab

target                0   1
relevent_experience
0                    30   7
1                    93  15

In [115]:
q2_out = chi2_contingency(q2_tab)

In [116]:
q2_out

(0.22142211039568746,
 0.6379584714909265,
 1,
 array([[31.3862069,  5.6137931],
        [91.6137931, 16.3862069]]))

In [117]:
# 답 : 0.64

In [120]:
# 3.(Dataset_13_train.csv를 활용하여) 인사팀에서는 어떤 직원이 이직 의사를 가지고 있을지
# 사전에 파악하고 1:1 면담 등 집중 케어를 하고자 한다. 이를 위해 의사결정 나무를
# 활용하여 모델을 생성하고 그 정확도를 확인하시오.
# - target을 종속변수로 하고 나머지 변수 중 String이 아닌 변수를 독립변수로 한다.
# - 학습은 전부 기본값으로 실시한다.
# - 평가는 "Dataset_13_test.csv" 데이터로 실시한다.
# - 정확도는 반올림하여 소수점 둘째 자리까지 기술하시오. (답안 예시) 0.12

In [121]:
# from sklearn.tree import DecisionTreeClassifier
# random_state = 123

In [119]:
data13.head()

,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,last_new_job,training_hours,target
0,0.516,Male,1,0,Graduate,STEM,13,5,36,1
1,0.766,Male,1,0,Graduate,STEM,12,5,264,0
2,0.920,Male,1,0,Masters,STEM,10,2,99,0
3,0.899,Male,1,0,Graduate,Business Degree,16,1,20,0
4,0.884,Male,1,0,Masters,STEM,20,5,39,0

In [122]:
data13.dtypes

city_development_index    float64
gender                     object
relevent_experience         int64
enrolled_university         int64
education_level            object
major_discipline           object
experience                  int64
last_new_job                int64
training_hours              int64
target                      int64
dtype: object

In [124]:
var_list = data13.columns[data13.dtypes != 'object'].drop('target')
var_list

Index(['city_development_index', 'relevent_experience', 'enrolled_university',
       'experience', 'last_new_job', 'training_hours'],
      dtype='object')

In [125]:
from sklearn.tree import DecisionTreeClassifier

In [126]:
model = DecisionTreeClassifier(random_state=123)

In [127]:
model.fit(data13[var_list], data13['target'])

DecisionTreeClassifier(random_state=123)

In [132]:
test = pd.read_csv('../Dataset/Dataset_13_test.csv')

In [133]:
model.score(test[var_list], test['target'])

0.672

In [134]:
# 답 0.67

In [135]:
# # 문제 14 유형(DataSet_14.csv 이용)
#
# 구분자 : comma(“,”), 2000 Rows, 9 Columns, UTF-8 인코딩
#
# 온라인 교육업체 싱글캠퍼스에서 런칭한 교육 플랫폼을 보다
# 체계적으로 운영하기 위해 2014년부터 2016년 동안 개설된 강좌
# 2000개를 대상으로 강좌 실적 및 고객의 서비스 분석을 실시하려고
# 한다. 관련 데이터는 다음과 같다.
#
# 컬 럼 / 정 의 / Type
# id / 강좌 일련번호 / Double
# published / 강과 개설일 / String
# subject / 강좌 대주제 / String
# level / 난이도 / String
# price / 가격(만원) / Double
# subscribers / 구독자 수(결제 인원) / Double
# reviews / 리뷰 개수 / Double
# lectures / 강좌 영상 수 / Double
# duration / 강좌 총 길이(시간) / Double

In [140]:
import pandas as pd
import numpy as np

In [141]:
data14 = pd.read_csv('../Dataset/Dataset_14.csv')
data14.head(3)

,id,published,subject,level,price,subscribers,reviews,lectures,duration
0,1,2015-07-10,Business Finance,Beginner Level,1.7,56,8,18,2.000000
1,2,2016-10-25,Business Finance,All Levels,17.4,336,6,13,0.683333
2,3,2015-06-16,Business Finance,All Levels,8.3,871,79,59,2.000000

In [142]:
# 1.결제 금액이 1억 이상이면서 구독자의 리뷰 작성 비율이 10% 이상인 교육의 수는?
# - 결제 금액은 강좌 가격에 구독자 수를 곱한 값이다.
# - 리뷰 작성 비율은 리뷰 개수에 구독자 수를 나눈 값이다. (답안 예시) 1

In [143]:
data14['income'] = data14['price'] * data14['subscribers']

In [144]:
data14['review_rate'] = data14['reviews'] / data14['subscribers']

In [145]:
ord1 = (data14['income'] >= 10000)
ord2 = (data14['review_rate'] >= 0.1)

In [151]:
len(data14[ord1 & ord2])

59

In [152]:
# 답 : 59

In [153]:
# 2.강좌 가격이 비쌀수록 구독자 숫자는 줄어든다는 가설을 확인하기 위해 상관분석을
# 실시하고자 한다. 2016년 개설된 Web Development 강좌를 대상으로 강좌 가격과
# 구독자 수의 피어슨 상관관계를 기술하시오.
# - 상관계수는 반올림하여 소수점 둘째 자리까지 기술하시오. (답안 예시) 0.12

In [154]:
data14['published'] = pd.to_datetime(data14['published'])

In [156]:
data14['year'] = data14['published'].dt.year

In [157]:
data14.head(3)

,id,published,subject,level,price,subscribers,reviews,lectures,duration,income,review_rate,year
0,1,2015-07-10,Business Finance,Beginner Level,1.7,56,8,18,2.000000,95.2,0.142857,2015
1,2,2016-10-25,Business Finance,All Levels,17.4,336,6,13,0.683333,5846.4,0.017857,2016
2,3,2015-06-16,Business Finance,All Levels,8.3,871,79,59,2.000000,7229.3,0.090700,2015

In [158]:
ord1 = (data14['subject'] == 'Web Development')
ord2 = (data14['year'] == 2016)

In [159]:
result = data14[ord1 & ord2]
result.head(3)

,id,published,subject,level,price,subscribers,reviews,lectures,duration,income,review_rate,year
6,7,2016-10-24,Web Development,Intermediate Level,17.4,9773,117,65,4.5,170050.2,0.011972,2016
36,37,2016-04-05,Web Development,All Levels,17.0,12068,81,12,1.5,205156.0,0.006712,2016
43,44,2016-03-28,Web Development,All Levels,2.2,3133,351,63,6.0,6892.6,0.112033,2016

In [161]:
result[['price', 'subscribers']].corr()

                price  subscribers
price        1.000000     0.034392
subscribers  0.034392     1.000000

In [162]:
# 답 : 0.03

In [163]:
# 3.유저가 서비스 사용에 익숙해지고 컨텐츠의 좋은 내용을 서로 공유하려는 경향이
# 전반적으로 증가하는 추세라고 한다. 이를 위해 먼저 강좌 개설 년도별 구독자의 리뷰
# 작성 비율의 평균이 강좌 개설 년도별로 차이가 있는지 일원 분산 분석을 통해서
# 알아보고자 한다. 이 때 검정통계량을 기술하시오.
# - 검정통계량은 반올림하여 소수점 첫째 자리까지 기술하시오. (답안 예시) 0.1
#
# (참고)
# from statsmodels.formula.api import ols
# from statsmodels.stats.anova import anova_lm

In [164]:
from statsmodels.formula.api import ols
from statsmodels.stats.anova import anova_lm

In [165]:
model = ols('review_rate~C(year)', data =data14).fit()

In [166]:
anova_lm(model)

              df     sum_sq   mean_sq          F        PR(>F)
C(year)      2.0   0.365685  0.182842  18.542038  1.049908e-08
Residual  1997.0  19.692334  0.009861        NaN           NaN

In [167]:
# 답 : 18.5

In [168]:
# # 문제 05 유형(Dataset_05_Mart_POS.csv /  이용)
#
# =============================================================================
# Dataset_05_Mart_POS.csv 
# 구분자 : comma(“,”), 20488 Rows, 3 Columns, UTF-8 인코딩
# =============================================================================
#
# 원룸촌에 위치한 A마트는 데이터 분석을 통해 보다 체계적인 재고관리와
# 운영을 하고자 한다. 이를 위해 다음의 두 데이터 세트를 준비하였다.
#
# 컬 럼 / 정 의 / Type
# Member_number / 고객 고유 번호 / Double
# Date / 구매일 / String
# itemDescription / 상품명 / String

# =============================================================================
# Dataset_05_item_list.csv 
# 구분자 : comma(“,”), 167 Rows, 4 Columns, UTF-8 인코
# =============================================================================
#
# 컬 럼 / 정 의 / Type
# prod_id / 상품 고유 번호 / Double
# prod_nm / 상품명 / String
# alcohol / 주류 상품 여부(1 : 주류) / Integer
# frozen / 냉동 상품 여부(1 : 냉동) / Integer

In [169]:
import pandas as pd
import numpy as np

In [171]:
data15 = pd.read_csv('../Dataset/Dataset_05_Mart_POS.csv')
data15.head(3)

   Member_number        Date itemDescription
0           1220  2015-01-01     canned beer
1           1220  2015-01-01       margarine
2           1220  2015-01-01       chocolate

In [172]:
# 1.(Dataset_05_Mart_POS.csv를 활용하여) 가장 많은 제품이 팔린 날짜에 가장 많이 팔린
# 제품의 판매 개수는? (답안 예시) 1

In [173]:
data16 = pd.read_csv('../Dataset/Dataset_05_item_list.csv')
data16.head(3)

   prod_id         prod_nm  alcohol  frozen
0        1  tropical fruit        0       0
1        2      whole milk        0       0
2        3       pip fruit        0       0

In [178]:
q1 = data15['Date'].value_counts().idxmax()
q1

'2015-01-21'

In [181]:
data15[data15['Date']==q1]['itemDescription'].value_counts().max()

7

In [182]:
# 답 : 7

In [183]:
# 2. (Dataset_05_Mart_POS.csv, Dataset_05_item_list.csv를 활용하여) 
# 고객이 주류 제품을
# 구매하는 요일이 다른 요일에 비해 금요일과 토요일이 많을 것이라는 가설을 세웠다. 
# 이를 확인하기 위해 금요일과 토요일의 일별 주류제품 구매 제품 수 평균과 다른
# 요일의 일별 주류제품 구매 제품 수 평균이 서로 다른지 비교하기 위해 독립 2표본
# t검정을 실시하시오. 
# 해당 검정의 p-value를 기술하시오.
# - 1분기(1월 ~ 3월) 데이터만 사용하여 분석을 실시하시오.
# - 등분산 가정을 만족하지 않는다는 조건 하에 분석을 실시하시오.
# - p-value는 반올림하여 소수점 둘째 자리까지 기술하시오. (답안 예시) 0.12

In [184]:
type(data15.Date)

pandas.core.series.Series

In [186]:
data15['itemDescription'].str.slice(0,2)

0        ca
1        ma
2        ch
3        sa
4        sa
         ..
20483    cr
20484    ca
20485    ca
20486    de
20487    cu
Name: itemDescription, Length: 20488, dtype: object

In [187]:
pd.to_datetime(data15.Date).dt.month

0         1
1         1
2         1
3         1
4         1
         ..
20483    12
20484    12
20485    12
20486    12
20487    12
Name: Date, Length: 20488, dtype: int64

In [189]:
pd.to_datetime(data15.Date).dt.day_name(locale='ko')

0        목요일
1        목요일
2        목요일
3        목요일
4        목요일
        ...
20483    수요일
20484    수요일
20485    수요일
20486    수요일
20487    수요일
Name: Date, Length: 20488, dtype: object

In [190]:
pos1 = data15.copy()

In [191]:
pos1['month'] = pd.to_datetime(pos1.Date).dt.month
pos1['day'] = pd.to_datetime(pos1.Date).dt.day_name(locale='ko')
pos1['week'] = np.where(pos1.day.isin(['금요일', '토요일']), 1, 0)

In [192]:
merge1 = pd.merge(pos1, data16, left_on='itemDescription', right_on='prod_nm', how='left')
merge1.head()

,Member_number,Date,itemDescription,month,day,week,prod_id,prod_nm,alcohol,frozen
0,1220,2015-01-01,canned beer,1,목요일,0,25,canned beer,1,0
1,1220,2015-01-01,margarine,1,목요일,0,70,margarine,0,0
2,1220,2015-01-01,chocolate,1,목요일,0,14,chocolate,0,0
3,1235,2015-01-01,sausage,1,목요일,0,19,sausage,0,0
4,1235,2015-01-01,sausage,1,목요일,0,19,sausage,0,0

In [193]:
merge2 = merge1[merge1.month.isin([1, 2, 3])]

In [194]:
merge2

,Member_number,Date,itemDescription,month,day,week,prod_id,prod_nm,alcohol,frozen
0,1220,2015-01-01,canned beer,1,목요일,0,25,canned beer,1,0
1,1220,2015-01-01,margarine,1,목요일,0,70,margarine,0,0
2,1220,2015-01-01,chocolate,1,목요일,0,14,chocolate,0,0
3,1235,2015-01-01,sausage,1,목요일,0,19,sausage,0,0
4,1235,2015-01-01,sausage,1,목요일,0,19,sausage,0,0
...,...,...,...,...,...,...,...,...,...,...
5074,4678,2015-03-31,condensed milk,3,화요일,0,54,condensed milk,0,0
5075,4678,2015-03-31,pot plants,3,화요일,0,6,pot plants,0,0
5076,4678,2015-03-31,cling film/bags,3,화요일,0,85,cling film/bags,0,0
5077,4678,2015-03-31,soda,3,화요일,0,38,soda,0,0
5078,4678,2015-03-31,shopping bags,3,화요일,0,71,shopping bags,0,0

In [195]:
q2_tab = pd.pivot_table(merge2, index='Date', columns='week', values='alcohol', aggfunc='sum')
q2_tab

week          0    1
Date
2015-01-01  4.0  NaN
2015-01-02  NaN  3.0
2015-01-03  NaN  2.0
2015-01-04  4.0  NaN
2015-01-05  5.0  NaN
...         ...  ...
2015-03-27  NaN  5.0
2015-03-28  NaN  2.0
2015-03-29  5.0  NaN
2015-03-30  3.0  NaN
2015-03-31  4.0  NaN

[90 rows x 2 columns]

In [196]:
from scipy.stats import ttest_ind

In [199]:
q2_out = ttest_ind(q2_tab[0].dropna(), q2_tab[1].dropna(), equal_var=False)

In [200]:
q2_out

Ttest_indResult(statistic=2.335264239960428, pvalue=0.023062611047582393)

In [201]:
# 답 : 0.02

In [202]:
# 3.(Dataset_05_Mart_POS.csv를 활용하여) 1년 동안 가장 많이 판매된 10개 상품을 주력
# 상품으로 설정하고 특정 요일에 프로모션을 진행할지 말지 결정하고자 한다. 먼저
# 요일을 선정하기 전에 일원 분산 분석을 통하여 요일별 주력 상품의 판매 개수의
# 평균이 유의미하게 차이가 나는지 알아보고자 한다. 이와 관련하여 일원 분산 분석을
# 실시하고 p-value를 기술하시오.
# - p-value는 반올림하여 소수점 둘째 자리까지 기술하시오. (답안 예시) 0.12
# 
# (참고)
# from statsmodels.formula.api import ols
# from statsmodels.stats.anova import anova_lm

In [203]:
pos1.head()

   Member_number        Date itemDescription  month  day  week
0           1220  2015-01-01     canned beer      1  목요일     0
1           1220  2015-01-01       margarine      1  목요일     0
2           1220  2015-01-01       chocolate      1  목요일     0
3           1235  2015-01-01         sausage      1  목요일     0
4           1235  2015-01-01         sausage      1  목요일     0

In [205]:
top10 = pos1.itemDescription.value_counts().nlargest(10)
top10

whole milk          1464
other vegetables    1039
rolls/buns           879
sausage              744
soda                 737
yogurt               694
tropical fruit       668
root vegetables      592
citrus fruit         544
frankfurter          505
Name: itemDescription, dtype: int64

In [206]:
top10_list = top10.index

In [209]:
q3 = pos1[pos1.itemDescription.isin(top10_list)]
q3.head(3)

   Member_number        Date itemDescription  month  day  week
3           1235  2015-01-01         sausage      1  목요일     0
4           1235  2015-01-01         sausage      1  목요일     0
7           1422  2015-01-01  tropical fruit      1  목요일     0

In [214]:
q3_agg = q3.groupby(['Date', 'day'])['itemDescription'].apply(len).reset_index()
q3_agg

           Date  day  itemDescription
0    2015-01-01  목요일               16
1    2015-01-02  금요일               13
2    2015-01-03  토요일               28
3    2015-01-04  일요일               21
4    2015-01-05  월요일               30
..          ...  ...              ...
359  2015-12-26  토요일               11
360  2015-12-27  일요일               31
361  2015-12-28  월요일               21
362  2015-12-29  화요일               27
363  2015-12-30  수요일               18

[364 rows x 3 columns]

In [215]:
from statsmodels.formula.api import ols
from statsmodels.stats.anova import anova_lm

In [216]:
model = ols('itemDescription~day', data=q3_agg).fit()

In [218]:
anova_lm(model)

             df        sum_sq    mean_sq        F    PR(>F)
day         6.0    219.527473  36.587912  0.86853  0.518128
Residual  357.0  15039.076923  42.126266      NaN       NaN

In [ ]:
# 답 : 0.52